trade_exp/src/Catalogs/НоменклатураКонтрагентов/НоменклатураКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fb652c53-8b80-4555-a9eb-dba4d24c612d">
  <name>НоменклатураКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="35dcedc2-6c02-4494-a957-999efc7f1ae7">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4b9e71aa-206f-494a-be92-2099bc584304">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e355be6-f29f-46ba-a67b-b41db62687e6">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a2c26441-ecdb-4656-bfd2-15f5621bd867">
    <name>Артикул</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ba1c2c1-f2b5-4b91-81cd-71906bc59b5a">
    <name>СсылкаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e389a121-b8cf-4d11-880c-d1a91f8a65c6">
    <name>ИдентификаторХарактеристикиСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6c2e5f0-1d5b-4909-b1f4-190730a95807">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="08da99ab-bdc3-4fbb-b68e-98ba498e8814">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="76b8b4ff-dbbb-41af-b9d3-eece0efd384e">
    <name>НаименованиеХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="886b5382-1411-426f-bae0-51a8d59061d3">
    <name>НаименованиеНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="68ea9c88-8801-4703-ac3e-ff587347cf04">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a5af94d-ca5b-4cb0-be5e-029447ca2a71">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="34a1357c-8d63-4c12-b663-e88abd1d7df4">
    <name>ИдентификаторУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bca5b07c-01c8-4c0b-9ed7-4810c51d3910">
    <name>КоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1dba536a-b803-434b-94a3-80de0cfbde3d">
    <name>КоличествоБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a38082a7-b8ce-49cf-85e3-056c1cd803fc">
    <name>КодОКЕИБазовойЕдиницыИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="891c08dd-bcea-4e09-809d-8e830642d676">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e18d6d8-c79f-42e1-95f0-16d93af84adb">
    <name>ИдентификаторНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6130cd0e-f870-4377-baac-01dd976a0c5d">
    <name>ИдентификаторХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="813f8473-3a44-42ee-a3d0-207a403b522c">
    <name>ИдентификаторНоменклатурыСервиса</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a5f5f8-7089-4e4c-af50-898ec05999a2">
    <name>КратностьПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6df5f190-8dbb-42e5-9d6a-fe9c6a02f8c7">
    <name>КратностьНаша</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0838c53d-d8ea-408d-9855-9df21318eea1">
    <name>КоэффициентКратности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d4978b9b-01f1-4377-bc57-fba19aff59b7">
    <name>ЕдиницаПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="47d77738-1948-484f-ac39-88caf37b918b">
    <name>ДругиеШтрихкодыНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="d217e494-52d2-47db-bda3-c73ad5bd093e">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>300</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Catalogs/НоменклатураКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ВладелецНоменклатуры) Тогда 
		Элементы.НадписьВладельца.Заголовок = Строка(Объект.ВладелецНоменклатуры);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура Док_КратностьПоставщикаПриИзмененииПосле(Элемент)
	Если Объект.КратностьПоставщика <> 0 Тогда
		Объект.КоэффициентКратности = Объект.КратностьНаша/Объект.КратностьПоставщика;
	Иначе
		Объект.КоэффициентКратности = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_КратностьНашаПриИзмененииПосле(Элемент)
	Если Объект.КратностьПоставщика <> 0 Тогда
		Объект.КоэффициентКратности = Объект.КратностьНаша/Объект.КратностьПоставщика;
	Иначе
		Объект.КоэффициентКратности = 0;
	КонецЕсли;
КонецПроцедуры
